Revit 2027 API
Space.CeilingReflectance Property
Get or set the Ceiling Reflectance of the Space.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double CeilingReflectance { get; set; }
Public Property CeilingReflectance As Double
	Get
	Set
public:
property double CeilingReflectance {
	double get ();
	void set (double value);
}
member CeilingReflectance : float with get, set
Property Value
Double
Remarks
This property is used to get or set the Ceiling Reflectance of the Space.
See Also
Reference
Space Class
Autodesk.Revit.DB.Mechanical Namespace